-- //1
SELECT Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД, Н_ВЕДОМОСТИ.ИД 
FROM Н_ТИПЫ_ВЕДОМОСТЕЙ 
JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ТВ_ИД=Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД
WHERE Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД=3 AND Н_ВЕДОМОСТИ.ИД=1426978 AND Н_ВЕДОМОСТИ.ИД<1457443;

SELECT Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД, Н_ВЕДОМОСТИ.ИД 
FROM Н_ТИПЫ_ВЕДОМОСТЕЙ 
JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ТВ_ИД=Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД
WHERE Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД=3 AND Н_ВЕДОМОСТИ.ИД<1457443;

-- //2
SELECT Н_ЛЮДИ.ФАМИЛИЯ, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.ИД 
FROM Н_ЛЮДИ RIGHT JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД=Н_ЛЮДИ.ИД
RIGHT JOIN Н_СЕССИЯ ON Н_СЕССИЯ.ИД=Н_ВЕДОМОСТИ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ИМЯ < 'Владимир' AND Н_ВЕДОМОСТИ.ИД = 1426978;

SELECT Н_ЛЮДИ.ФАМИЛИЯ, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.ИД 
FROM Н_ЛЮДИ RIGHT JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД=Н_ЛЮДИ.ИД
RIGHT JOIN Н_СЕССИЯ ON Н_СЕССИЯ.ЧЛВК_ИД=Н_ВЕДОМОСТИ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ИМЯ < 'Владимир' AND Н_ВЕДОМОСТИ.ИД < 1426978;

-- //3
SELECT EXISTS (
    SELECT 1 FROM Н_УЧЕНИКИ 
    JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД 
    JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
    WHERE Н_ПЛАНЫ.ФО_ИД = (SELECT ИД FROM Н_ФОРМЫ_ОБУЧЕНИЯ
WHERE ИМЯ_В_ИМИН_ПАДЕЖЕ='вечерняя') AND Н_ЛЮДИ.ИНН IS NULL
);

(SELECT ИД FROM Н_ФОРМЫ_ОБУЧЕНИЯ
WHERE ИМЯ_В_ИМИН_ПАДЕЖЕ='вечерняя'); 
(SELECT ИД FROM Н_ФОРМЫ_ОБУЧЕНИЯ
WHERE ИМЯ_В_ИМИН_ПАДЕЖЕ='заочная');
(SELECT ИД FROM Н_ФОРМЫ_ОБУЧЕНИЯ
WHERE ИМЯ_В_ИМИН_ПАДЕЖЕ='очная');

-- //4
SELECT Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД  FROM Н_ГРУППЫ_ПЛАНОВ
JOIN Н_ПЛАНЫ ON  Н_ПЛАНЫ.ПЛАН_ИД=Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД
WHERE Н_ПЛАНЫ.ФО_ИД=(SELECT ИД FROM Н_ФОРМЫ_ОБУЧЕНИЯ
WHERE ИМЯ_В_ИМИН_ПАДЕЖЕ='заочная')
GROUP BY Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД
HAVING COUNT(*)=2;

SELECT Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД FROM Н_ГРУППЫ_ПЛАНОВ
JOIN Н_ПЛАНЫ ON  Н_ПЛАНЫ.ПЛАН_ИД=Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД
WHERE Н_ПЛАНЫ.ФО_ИД=(SELECT ИД FROM Н_ФОРМЫ_ОБУЧЕНИЯ
WHERE ИМЯ_В_ИМИН_ПАДЕЖЕ='очная')
GROUP BY Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД
HAVING COUNT(*)>2;

--5
SELECT s.ЧЛВК_ИД, s.ГРУППА, CONCAT(l.ФАМИЛИЯ,' ',l.ИМЯ,' ',l.ОТЧЕСТВО) as ФИО, AVG(v.ОЦЕНКА::integer)FROM Н_УЧЕНИКИ s
JOIN Н_ЛЮДИ l ON l.ИД=s.ЧЛВК_ИД
JOIN Н_ВЕДОМОСТИ v ON s.ЧЛВК_ИД=v.ЧЛВК_ИД
WHERE s.ГРУППА = '4100' AND v.ОЦЕНКА~'^\d+$'
GROUP BY s.ЧЛВК_ИД, s.ГРУППА, l.ФАМИЛИЯ, l.ИМЯ, l.ОТЧЕСТВО 
HAVING AVG(v.ОЦЕНКА::integer)>=
(SELECT AVG(nv.ОЦЕНКА::integer) FROM Н_УЧЕНИКИ ns
JOIN Н_ВЕДОМОСТИ nv ON ns.ЧЛВК_ИД=nv.ЧЛВК_ИД
WHERE ns.ГРУППА='1101' AND nv.ОЦЕНКА~'^\d+$'
);

--6
SELECT Н_УЧЕНИКИ.ГРУППА, Н_УЧЕНИКИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ,
Н_ЛЮДИ.ОТЧЕСТВО, Н_ПЛАНЫ.НОМЕР, Н_УЧЕНИКИ.СОСТОЯНИЕ FROM Н_УЧЕНИКИ
JOIN Н_ЛЮДИ ON Н_ЛЮДИ.ИД=Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД=Н_ПЛАНЫ.ИД
WHERE Н_ПЛАНЫ.ФО_ИД=(SELECT ИД FROM Н_ФОРМЫ_ОБУЧЕНИЯ
WHERE ИМЯ_В_ИМИН_ПАДЕЖЕ='заочная')
AND date(Н_ПЛАНЫ.ДАТА_УТВЕРЖДЕНИЯ)<'01.09.2012' AND Н_ПЛАНЫ.КУРС=1
GROUP BY Н_УЧЕНИКИ.ГРУППА, Н_УЧЕНИКИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ,
Н_ЛЮДИ.ОТЧЕСТВО, Н_ПЛАНЫ.НОМЕР, Н_УЧЕНИКИ.СОСТОЯНИЕ;

SELECT Н_УЧЕНИКИ.ГРУППА, Н_УЧЕНИКИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ,
Н_ЛЮДИ.ОТЧЕСТВО, Н_ПЛАНЫ.НОМЕР, Н_УЧЕНИКИ.СОСТОЯНИЕ FROM Н_УЧЕНИКИ
JOIN Н_ЛЮДИ ON Н_ЛЮДИ.ИД=Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД=Н_ПЛАНЫ.ИД
WHERE Н_ПЛАНЫ.ФО_ИД=(SELECT ИД FROM Н_ФОРМЫ_ОБУЧЕНИЯ
WHERE ИМЯ_В_ИМИН_ПАДЕЖЕ='очная')
 AND date(Н_ПЛАНЫ.ДАТА_УТВЕРЖДЕНИЯ)<'01.09.2012' AND Н_ПЛАНЫ.КУРС=1
GROUP BY Н_УЧЕНИКИ.ГРУППА, Н_УЧЕНИКИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ,
Н_ЛЮДИ.ОТЧЕСТВО, Н_ПЛАНЫ.НОМЕР, Н_УЧЕНИКИ.СОСТОЯНИЕ;
 
 --7
SELECT Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ FROM Н_ЛЮДИ
WHERE Н_ЛЮДИ.ИД != any(SELECT ЧЛВК_ИД FROM Н_УЧЕНИКИ)
GROUP BY Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ;
